Revit 2026 API

# ControlledApplicationApplicationInitialized Event

---

Subscribe to this event to get notified after the Revit application has been initialized.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public event EventHandler<ApplicationInitializedEventArgs> ApplicationInitialized
```
```vb
Public Event ApplicationInitialized As EventHandler(Of ApplicationInitializedEventArgs)
```
```cpp
public:
 event EventHandler<ApplicationInitializedEventArgs^>^ ApplicationInitialized {
	void add (EventHandler<ApplicationInitializedEventArgs^>^ value);
	void remove (EventHandler<ApplicationInitializedEventArgs^>^ value);
}
```
```fsharp
member ApplicationInitialized : IEvent<EventHandler<ApplicationInitializedEventArgs>,
    ApplicationInitializedEventArgs>
```

#### Value

EventHandlerApplicationInitializedEventArgs

The event is raised after Revit was launched as fully initialized, including initialization of external applications.

The event is not cancellable; the 'Cancellable' property of the event's argument is always False.

#### Reference

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace